# Ultralytics YOLOv8s-CBAM
# Based on YOLOv8s

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 
  s: [0.33, 0.50, 1024] 
  m: [0.67, 0.75, 768] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.25, 512] 

# YOLOv8.0s backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, CBAM, [64]] # 3-CBAM (P2)
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]] # 5
  - [-1, 1, CBAM, [128]] # 6-CBAM (P3)
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]] # 8
  - [-1, 1, CBAM, [256]] # 9-CBAM (P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]] # 11
  - [-1, 1, CBAM, [512]] # 12-CBAM (P5)
  - [-1, 1, SPPF, [1024, 5]] # 12

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4 (CBAM output is index 8)
  - [-1, 3, C2f, [512]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3 (CBAM output is index 5)
  - [-1, 3, C2f, [256]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P5 (SPPF output is index 12)
  - [-1, 3, C2f, [1024]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)
